tests/form-service/load.yml
config:
  environments:
    dev:
      target: 'https://form-service.adsp-dev.gov.ab.ca'
    uat:
      target: 'https://form-service.adsp-uat.alberta.ca'

  # Default headers applied to all requests
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'

  # Custom JS processor for auth + behavior control
  processor: './processor.mjs'

  # CSV payloads used to parameterize test data
  payload:
    # Environment-specific Keycloak config
    - path: '../artillery.{{ $environment }}.csv'
      skipHeader: true
      fields:
        - keycloak_url
        - realm_id
        - tenant_name
        - client_id
        - username

    # Form definitions to create
    - path: './definitions.csv'
      skipHeader: true
      fields:
        - definition_id

    # Applicant data used in form creation
    - path: './applicants.csv'
      skipHeader: true
      fields:
        - first_name
        - last_name

  # Load phases
  phases:
    - name: warm up
      duration: 30
      arrivalCount: 30

    - name: load
      duration: 1200
      arrivalCount: 5000

scenarios:
  - name: Create → Update → Submit form flow
    beforeScenario: beforeScenario

    flow:
      - post:
          url: '/form/v1/forms'
          headers:
            authorization: 'Bearer {{ token }}'
          json:
            definitionId: '{{ definition_id }}'
            applicant:
              addressAs: '{{ first_name }} {{ last_name }}'
            data:
              firstName: '{{ first_name }}'
              secondName: '{{ last_name }}'
          capture:
            - json: '$.id'
              as: form_id

      - log: 'Created form {{ form_id }}'
      - think: 3

      # Update loop (only runs if doUpdate is true)
      - log: 'Update form {{ form_id }} {{ updateCount }} times if doUpdate={{ doUpdate }}'
      - loop:
          - put:
              url: '/form/v1/forms/{{ form_id }}/data'
              headers:
                authorization: 'Bearer {{ token }}'
              json:
                data:
                  firstName: '{{ first_name }}'
                  secondName: '{{ last_name }}'
              ifTrue: '{{ doUpdate }}'
        count: '{{ updateCount }}'

      - think: 4

      # Submit + delete (only runs if doSubmit is true)
      - log: 'Submit form {{ form_id }} if doSubmit={{ doSubmit }}'
      - post:
          url: '/form/v1/forms/{{ form_id }}'
          headers:
            authorization: 'Bearer {{ token }}'
          json:
            operation: submit
          ifTrue: '{{ doSubmit }}'

      - log: 'Delete form {{ form_id }} if doSubmit={{ doSubmit }}'
      - delete:
          url: '/form/v1/forms/{{ form_id }}'
          headers:
            authorization: 'Bearer {{ token }}'
          ifTrue: '{{ doSubmit }}'